# 서비스 이해 기본
# q1. 2020년 7월의 총 Revenue를 구해라
# q2. 2020년 7월의 MAU를 구해라
# q3. 7월에 우리 Active 유저의 구매율 Paying Rate 는 어떻게 되나?
# q4. 7월에 구매 유저의 월 평균 구매 금액은 어떻게 되는가?
# q5. 7월에 가장 많이 구매한 고객 top3와 top10 ~ 15 고객을 구해라

# 날짜, 시간별 분석
# q6. 2020년 7월의 평균 DAU를 구하라, Active User 수가 증가하는 추세인가?
# q7. 2020년 7월의 평균 WAU를 구하라
# q8. 2020년 7월의 Daily Revenue는 증가하는 추세인가? 평균 Daily Revenue를 구하라
# q9. 2020년 7월의 평균 Weekly Revenue를 구하라
# q10. 2020년 7월 요일별 Revenue를 구하라. 어느 요일 Revenue가 가장 높고 낮은가?
# q11. 2020년 7월 시간대별 Revenue를 구하라 어느 시간 Revenue가 가장 높고 낮은가?
# q12. 2020년 7월 요일 및 시간대별 Revenue를 구하라. 어느 요일 및 시간대 Revenue가 가장 높고 낮은가?

# 유저 세그먼트별 분석
/* q13. 전체 유저의 Demographic을 성, 연령별로 유저 수를 구하라
		어느 세그먼트가 가장 숫자가 높은가? (기타 성별은 하나, 연령은 5세 단위, 내림차순)
*/
/* q14. q13 결과의 성,연령을 성별(연령) 으로 통합 및 각 성, 연령이 
		전체 고객에서 얼마나 차지하는지 분포(%)로 구하라 (내림차순)
*/ 
# q15. 2020년 7월의 성별에 따라 구매 건수 및 총 Revenue를 구하라. 남녀 이외 성별은 하나로 묶어라
# q16. 2020년 7월의 성별, 연령대에 따라 구매 건수 및 총 Revenue를 구하라. 남녀 이외 성별은 하나로 묶어라

# 매출 관련 추가 분석
# q17. 2020년 7월 일별 매출과 증감폭, 증감률을 구하라
/* q18. 2020년 7월 일별로 많이 구매한 고객들을 구하라, 
7월 일별 구매 금액 기준 가장 많이 지출한 고개 top 3를 구하라
*/

# 프로덕트 분석 심화
/* q19. 2020년 7월 신규 유저가 하루 안에 결제로 넘어가는 비율을 구하라
		그 비율이 어떠하며, 결제까지 보통 몇 분이 소요되는지 구하라
*/
/* q20. 2020년 7월 유저의 재방문율이 높은가? 
7월 기준 Day1 Retention이 어떤지 구하고 추세를 Daily로 추출하라
*/
# q21. 가입 기간별 고객 분포가 어떤지 구하라 DAU 기준